[Killed] StringLiteral
../employee-project/controller/employee.controller.js:1:31
-const employeeModel = require("../model/employee.model");
+const employeeModel = require("");
 // const joi = require("@hapi/joi");
 const joi = require("joi");

[Killed] StringLiteral
../employee-project/controller/employee.controller.js:4:24
 const employeeModel = require("../model/employee.model");
 // const joi = require("@hapi/joi");
 const joi = require("joi");
-const bcrypt = require("bcrypt");
+const bcrypt = require("");
 const jwt = require("jsonwebtoken");
 const saltRounds = 10;

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:16:52
   phone: joi.string(),
 });
 
-exports.createEmployee = async (req, res, next) => {
-  try {
-    // console.log("create employee called");
-    const joiCheck = await schema.validate(req.body);
-    // console.log("validation result", joiCheck);
-    if (joiCheck.error) return res.status(400).json(joiCheck.error);
-    const doEmailExist = await employeeModel.findOne({ email: req.body.email });
-    // console.log("doEmailExist :", doEmailExist)
-    if (doEmailExist) {
-      return res
-        .status(400)
-        .json("Email you provided already exist in our database");
-    }
-    const salt = await bcrypt.genSalt(saltRounds);
-    const encryptedPassword = await bcrypt.hash(req.body.password, salt);
-    console.log(encryptedPassword);
-    req.body.password = encryptedPassword;
-    const newEmployee = await employeeModel.create(req.body);
-    console.log(newEmployee);
-    res.status(201).json(newEmployee);
-  } catch (err) {
-    console.log(err);
-    res.status(500).json(err);
-  }
-};
+exports.createEmployee = async (req, res, next) => {};
 
 exports.getAllEmployees = async (req, res, next) => {

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:17:7
 });
 
 exports.createEmployee = async (req, res, next) => {
-  try {
-    // console.log("create employee called");
-    const joiCheck = await schema.validate(req.body);
-    // console.log("validation result", joiCheck);
-    if (joiCheck.error) return res.status(400).json(joiCheck.error);
-    const doEmailExist = await employeeModel.findOne({ email: req.body.email });
-    // console.log("doEmailExist :", doEmailExist)
-    if (doEmailExist) {
-      return res
-        .status(400)
-        .json("Email you provided already exist in our database");
-    }
-    const salt = await bcrypt.genSalt(saltRounds);
-    const encryptedPassword = await bcrypt.hash(req.body.password, salt);
-    console.log(encryptedPassword);
-    req.body.password = encryptedPassword;
-    const newEmployee = await employeeModel.create(req.body);
-    console.log(newEmployee);
-    res.status(201).json(newEmployee);
-  } catch (err) {
+  try {} catch (err) {
     console.log(err);
     res.status(500).json(err);

[Killed] ConditionalExpression
../employee-project/controller/employee.controller.js:21:9
     // console.log("create employee called");
     const joiCheck = await schema.validate(req.body);
     // console.log("validation result", joiCheck);
-    if (joiCheck.error) return res.status(400).json(joiCheck.error);
+    if (true) return res.status(400).json(joiCheck.error);
     const doEmailExist = await employeeModel.findOne({ email: req.body.email });
     // console.log("doEmailExist :", doEmailExist)

[Survived] ConditionalExpression
../employee-project/controller/employee.controller.js:21:9
     // console.log("create employee called");
     const joiCheck = await schema.validate(req.body);
     // console.log("validation result", joiCheck);
-    if (joiCheck.error) return res.status(400).json(joiCheck.error);
+    if (false) return res.status(400).json(joiCheck.error);
     const doEmailExist = await employeeModel.findOne({ email: req.body.email });
     // console.log("doEmailExist :", doEmailExist)

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:24:23
     if (joiCheck.error) return res.status(400).json(joiCheck.error);
     const doEmailExist = await employeeModel.findOne({ email: req.body.email });
     // console.log("doEmailExist :", doEmailExist)
-    if (doEmailExist) {
-      return res
-        .status(400)
-        .json("Email you provided already exist in our database");
-    }
+    if (doEmailExist) {}
     const salt = await bcrypt.genSalt(saltRounds);
     const encryptedPassword = await bcrypt.hash(req.body.password, salt);

[Killed] ConditionalExpression
../employee-project/controller/employee.controller.js:24:9
     if (joiCheck.error) return res.status(400).json(joiCheck.error);
     const doEmailExist = await employeeModel.findOne({ email: req.body.email });
     // console.log("doEmailExist :", doEmailExist)
-    if (doEmailExist) {
+    if (true) {
       return res
         .status(400)

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:36:17
     const newEmployee = await employeeModel.create(req.body);
     console.log(newEmployee);
     res.status(201).json(newEmployee);
-  } catch (err) {
-    console.log(err);
-    res.status(500).json(err);
-  }
+  } catch (err) {}
 };
 

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:42:53
   }
 };
 
-exports.getAllEmployees = async (req, res, next) => {
-  try {
-    const allEmployees = await employeeModel.find({});
-    if (allEmployees && allEmployees.length > 0) {
-      res.status(200).json(allEmployees);
-    } else {
-      res.status(404).json();
-    }
-  } catch (err) {
-    res.status(500).json(err);
-  }
-};
+exports.getAllEmployees = async (req, res, next) => {};
 
 exports.getEmployeeById = async (req, res, next) => {

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:43:7
 };
 
 exports.getAllEmployees = async (req, res, next) => {
-  try {
-    const allEmployees = await employeeModel.find({});
-    if (allEmployees && allEmployees.length > 0) {
-      res.status(200).json(allEmployees);
-    } else {
-      res.status(404).json();
-    }
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json(err);
   }

[Killed] ConditionalExpression
../employee-project/controller/employee.controller.js:45:9
 exports.getAllEmployees = async (req, res, next) => {
   try {
     const allEmployees = await employeeModel.find({});
-    if (allEmployees && allEmployees.length > 0) {
+    if (false) {
       res.status(200).json(allEmployees);
     } else {

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:45:50
 exports.getAllEmployees = async (req, res, next) => {
   try {
     const allEmployees = await employeeModel.find({});
-    if (allEmployees && allEmployees.length > 0) {
-      res.status(200).json(allEmployees);
-    } else {
+    if (allEmployees && allEmployees.length > 0) {} else {
       res.status(404).json();
     }

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:47:12
     const allEmployees = await employeeModel.find({});
     if (allEmployees && allEmployees.length > 0) {
       res.status(200).json(allEmployees);
-    } else {
-      res.status(404).json();
-    }
+    } else {}
   } catch (err) {
     res.status(500).json(err);

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:50:17
     } else {
       res.status(404).json();
     }
-  } catch (err) {
-    res.status(500).json(err);
-  }
+  } catch (err) {}
 };
 

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:55:53
   }
 };
 
-exports.getEmployeeById = async (req, res, next) => {
-  try {
-    const employee = await employeeModel.findById(req.params.employee_id);
-    if (employee) {
-      res.status(200).json(employee);
-    } else {
-      res.status(404).send();
-    }
-  } catch (err) {
-    console.log(err);
-    res.status(500).send(err);
-  }
-};
+exports.getEmployeeById = async (req, res, next) => {};
 
 //using callback

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:56:7
 };
 
 exports.getEmployeeById = async (req, res, next) => {
-  try {
-    const employee = await employeeModel.findById(req.params.employee_id);
-    if (employee) {
-      res.status(200).json(employee);
-    } else {
-      res.status(404).send();
-    }
-  } catch (err) {
+  try {} catch (err) {
     console.log(err);
     res.status(500).send(err);

[Killed] ConditionalExpression
../employee-project/controller/employee.controller.js:58:9
 exports.getEmployeeById = async (req, res, next) => {
   try {
     const employee = await employeeModel.findById(req.params.employee_id);
-    if (employee) {
+    if (false) {
       res.status(200).json(employee);
     } else {

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:58:19
 exports.getEmployeeById = async (req, res, next) => {
   try {
     const employee = await employeeModel.findById(req.params.employee_id);
-    if (employee) {
-      res.status(200).json(employee);
-    } else {
+    if (employee) {} else {
       res.status(404).send();
     }

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:60:12
     const employee = await employeeModel.findById(req.params.employee_id);
     if (employee) {
       res.status(200).json(employee);
-    } else {
-      res.status(404).send();
-    }
+    } else {}
   } catch (err) {
     console.log(err);

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:63:17
     } else {
       res.status(404).send();
     }
-  } catch (err) {
-    console.log(err);
-    res.status(500).send(err);
-  }
+  } catch (err) {}
 };
 

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:85:56
 //     }
 // };
 
-exports.updateEmployeeById = async (req, res, next) => {
-  try {
-    const updatedEmployee = await employeeModel.findByIdAndUpdate(
-      req.params.employee_id,
-      req.body,
-      {
-        useFindAndModify: false,
-      }
-    );
-    if (updatedEmployee) {
-      res.status(201).json(updatedEmployee);
-    } else {
-      res.status(400).send();
-    }
-  } catch (err) {
-    console.log(err);
-    res.status(500).json(err);
-  }
-};
+exports.updateEmployeeById = async (req, res, next) => {};
 
 exports.deleteEmployeeById = async (req, res, next) => {

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:86:7
 // };
 
 exports.updateEmployeeById = async (req, res, next) => {
-  try {
-    const updatedEmployee = await employeeModel.findByIdAndUpdate(
-      req.params.employee_id,
-      req.body,
-      {
-        useFindAndModify: false,
-      }
-    );
-    if (updatedEmployee) {
-      res.status(201).json(updatedEmployee);
-    } else {
-      res.status(400).send();
-    }
-  } catch (err) {
+  try {} catch (err) {
     console.log(err);
     res.status(500).json(err);

[Killed] ObjectLiteral
../employee-project/controller/employee.controller.js:90:7
     const updatedEmployee = await employeeModel.findByIdAndUpdate(
       req.params.employee_id,
       req.body,
-      {
-        useFindAndModify: false,
-      }
+      {}
     );
     if (updatedEmployee) {

[Killed] BooleanLiteral
../employee-project/controller/employee.controller.js:91:27
       req.params.employee_id,
       req.body,
       {
-        useFindAndModify: false,
+        useFindAndModify: true,
       }
     );

[Killed] ConditionalExpression
../employee-project/controller/employee.controller.js:94:9
         useFindAndModify: false,
       }
     );
-    if (updatedEmployee) {
+    if (true) {
       res.status(201).json(updatedEmployee);
     } else {

[Killed] ConditionalExpression
../employee-project/controller/employee.controller.js:94:9
         useFindAndModify: false,
       }
     );
-    if (updatedEmployee) {
+    if (false) {
       res.status(201).json(updatedEmployee);
     } else {

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:96:12
     );
     if (updatedEmployee) {
       res.status(201).json(updatedEmployee);
-    } else {
-      res.status(400).send();
-    }
+    } else {}
   } catch (err) {
     console.log(err);

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:99:17
     } else {
       res.status(400).send();
     }
-  } catch (err) {
-    console.log(err);
-    res.status(500).json(err);
-  }
+  } catch (err) {}
 };
 

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:105:56
   }
 };
 
-exports.deleteEmployeeById = async (req, res, next) => {
-  try {
-    const deleted = await employeeModel.findByIdAndDelete(
-      req.params.employee_id
-    );
-    if (deleted) {
-      res.status(200).json(deleted);
-    } else {
-      //   console.log("User Not Found");
-      res.status(404).json("User Not Found");
-    }
-  } catch (err) {
-    console.log(err);
-    res.status(500).json(err);
-  }
-};
+exports.deleteEmployeeById = async (req, res, next) => {};
 
 // exports.deleteEmployeeById = async (req, res , next) =>{

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:106:7
 };
 
 exports.deleteEmployeeById = async (req, res, next) => {
-  try {
-    const deleted = await employeeModel.findByIdAndDelete(
-      req.params.employee_id
-    );
-    if (deleted) {
-      res.status(200).json(deleted);
-    } else {
-      //   console.log("User Not Found");
-      res.status(404).json("User Not Found");
-    }
-  } catch (err) {
+  try {} catch (err) {
     console.log(err);
     res.status(500).json(err);

[Killed] ConditionalExpression
../employee-project/controller/employee.controller.js:110:9
     const deleted = await employeeModel.findByIdAndDelete(
       req.params.employee_id
     );
-    if (deleted) {
+    if (false) {
       res.status(200).json(deleted);
     } else {

[Killed] ConditionalExpression
../employee-project/controller/employee.controller.js:110:9
     const deleted = await employeeModel.findByIdAndDelete(
       req.params.employee_id
     );
-    if (deleted) {
+    if (true) {
       res.status(200).json(deleted);
     } else {

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:112:12
     );
     if (deleted) {
       res.status(200).json(deleted);
-    } else {
-      //   console.log("User Not Found");
-      res.status(404).json("User Not Found");
-    }
+    } else {}
   } catch (err) {
     console.log(err);

[Killed] StringLiteral
../employee-project/controller/employee.controller.js:114:28
       res.status(200).json(deleted);
     } else {
       //   console.log("User Not Found");
-      res.status(404).json("User Not Found");
+      res.status(404).json("");
     }
   } catch (err) {

[Killed] ConditionalExpression
../employee-project/controller/employee.controller.js:142:9
   try {
     const joiCheck = await schema.validate(req.body);
     // console.log("validation result", joiCheck.error);
-    if (joiCheck.error) return res.status(400).json(joiCheck.error);
+    if (true) return res.status(400).json(joiCheck.error);
     const employee = await employeeModel.findOne({ email: req.body.email });
     console.log(employee);

[Survived] ConditionalExpression
../employee-project/controller/employee.controller.js:142:9
   try {
     const joiCheck = await schema.validate(req.body);
     // console.log("validation result", joiCheck.error);
-    if (joiCheck.error) return res.status(400).json(joiCheck.error);
+    if (false) return res.status(400).json(joiCheck.error);
     const employee = await employeeModel.findOne({ email: req.body.email });
     console.log(employee);

[Killed] ConditionalExpression
../employee-project/controller/employee.controller.js:145:9
     if (joiCheck.error) return res.status(400).json(joiCheck.error);
     const employee = await employeeModel.findOne({ email: req.body.email });
     console.log(employee);
-    if (!employee) {
+    if (true) {
       return res
         .status(400)

[Killed] BooleanLiteral
../employee-project/controller/employee.controller.js:145:9
     if (joiCheck.error) return res.status(400).json(joiCheck.error);
     const employee = await employeeModel.findOne({ email: req.body.email });
     console.log(employee);
-    if (!employee) {
+    if (employee) {
       return res
         .status(400)

[Killed] ConditionalExpression
../employee-project/controller/employee.controller.js:155:9
       employee.password
     );
     // console.log("Password Validation: ", validatePassword);
-    if (!validatePassword)
+    if (false)
       return res
         .status(400)

[Killed] BooleanLiteral
../employee-project/controller/employee.controller.js:155:9
       employee.password
     );
     // console.log("Password Validation: ", validatePassword);
-    if (!validatePassword)
+    if (validatePassword)
       return res
         .status(400)

[Killed] StringLiteral
../employee-project/controller/employee.controller.js:158:15
     if (!validatePassword)
       return res
         .status(400)
-        .send("you provided an invalid password , please try again");
+        .send("");
     const jwtToken = await jwt.sign(
       {

[Survived] ObjectLiteral
../employee-project/controller/employee.controller.js:160:7
         .status(400)
         .send("you provided an invalid password , please try again");
     const jwtToken = await jwt.sign(
-      {
-        data: employee,
-      },
+      {},
       process.env.JWT_TOKEN_KEY,
       { expiresIn: "1h" }

[Survived] ObjectLiteral
../employee-project/controller/employee.controller.js:164:7
         data: employee,
       },
       process.env.JWT_TOKEN_KEY,
-      { expiresIn: "1h" }
+      {}
     );
     console.log(jwtToken);

[Killed] BlockStatement
../employee-project/controller/employee.controller.js:169:17
     console.log(jwtToken);
     res.header("auth-token", jwtToken);
     res.status(201).json(employee);
-  } catch (err) {
-    console.log(err);
-    res.status(500).json(err);
-  }
+  } catch (err) {}
 };
 
